using Project.V15.Lib;
namespace Project.V15.Test
{
    [TestClass]
    public class DataServiceTest
    {
        [TestMethod]
        public void TestMethodMatrix()
        {
            DataService ds = new DataService();
            string path = @"C:\Users\PC\source\repos\Tyuiu.KomarovaMV.Sprint7\Project.V15\Properties\InData.csv";
            string[,] data=ds.GetMatrix(path);
            string[,] res = { { "1", "Захарова Диана Георгиевна", "ул.Речная, 4", "менеджер", "45000", "1"}, { "2", "Кузнецова Варвара Максимовна", "ул.Заречная, 36", "секретарь", "65000", "6" },
                { "3", "Селезнева Милана Михайловна", "ул.Вишневая,11", "бухгалтер", "80000", "4"}, {"4", "Ершов Александр Кириллович", "ул.Заречная, 36", "архивариус", "55000", "8" }, 
                {"5", "Ермолаев Артём Егорович", "ул.Речная, 4", "бухгалтер", "76000", "3" },{"6", "Шмелева Алиса Алексеевна", "ул.Речная, 4", "менеджер", "60000", "6" },
                {"7", "Зайцева Дарья Тимуровна", "ул.Вишневая,11", "секретарь","59000","5" },{"8", "Сотникова Мария Тимуровна", "ул.Заречная, 36", "бухгалтер", "64000", "7" },
                { "9", "Иванов Илья Владимирович", "ул.Вишневая,11", "бухгалтер", "56000", "5"},{"10", "Фомичева Марьям Алексеевна", "ул.Заречная, 36", "архивариус", "45000", "2" },
                { "11", "Смирнов Фёдор Андреевич", "ул.Вишневая,11", "документовед", "67000", "12"},{ "12", "Емельянова Екатерина Владиславовна", "ул.Речная, 4", "архивариус", "50000", "3"},
                { "13", "Туманов Василий Максимович", "ул.Вишневая,11", "менеджер", "50000", "9"},
                {"14", "Максимова Арина Владимировна", "ул.Заречная, 36", "секретарь", "70000", "11" },{ "15", "Комиссаров Андрей Фёдорович", "ул.Речная, 4", "бухгалтер", "75000", "8"} };
            CollectionAssert.AreEqual(res,data);
        }
    }
}